{
  "profile": {
    "name": "Sang Hyup Han",
    "position": "프론트엔드 개발자",
    "message": "#실용주의 프로그래머의 길"
  },
  "about": {
    "title": "About",
    "subtitle": "개발자의 자세",
    "date": "2020-06-23",
    "texts": [
      "개발자는 무엇인가 만들어 내는 창작 행위를 하는 사람이다.",
      "창작을 한다는 것은 만들어 내고자 하는 것에 대한 본질을 꿰뚫고 원리를 이해하는 것에서 부터 시작된다. ",
      "이 과정에서 알지 못했던 것에대해 학습과 배움이라는 화학작용이 일어난다.",
      "이후 배움을 통해 흡수한 지식을 기술로 만들기 위한 단련 작업이 이루어지고 고된 단련 끝에 얻어진 기술을 응용하여 창조물이 나오기 시작한다.",
      "어떤 창작활동을 막론하고 모든 창작활동은 이 과정을 필수불가결하게 동반한다. ",
      "개발자는 창작 행위를 하는 사람이라는 정의를 중심으로 자신이 사용하는 언어와 프레임워크에 대한 배경을 학습하고 본질을 관통하여 원리를 이해하고 그것을 자신의 것으로 만들기 위한 기본적인 태도를 갖추어야 한다.",
      "프로그래밍 언어와 프레임워크들은 그저 이유없이 만들어 지지 않았다.",
      "그 안에는 수많은 천재들의 재능과 철학이 디자인 패턴과 아키텍쳐안에 녹아져 있다.",
      "개발자는 걷으로 보이는 프로그래밍 언어나 프레임워크를 사용하는 기술에 너무 치중하는 것 보다, DDD, MVVM, RESTful 등의 심도있는 원리에 대해 이해하기 위해 부단히 노력해야 한다. ",
      "이런 기술과 철학에 경외심을 갖고 탐하는 것이 개발자가 갖추어야할 덕목이자 태도이며, 더욱 심오한 기술의 세계로 향하는 시작이 될것이다."
    ]
  },

  "resume": {
    "projects": [
      {
        "title": "헬스네비 CMS 웹 클라이언트",
        "position": "프론트엔드",
        "period": "2018.10 ~ 2019.03",
        "company": "주식회사 도트만",
        "detail": "Spring Boot와 Polymer JS라는 프레임워크를 기반으로 제작된 약국관리 프로그램 헬스네비 CMS 웹 클라이언트 기능개발에 참여했으며, JPA를 통해 데이터 베이스로부터 데이터를 조회하여 서버사이드 렌더링을 통해 프론트로 전달하여 적절한 비즈니스 로직과 뷰를 갖추어 기본적인 프론트엔드 메뉴 구성 및 CRUD 기능 개발하였습니다.",
        "spec": ["Polymer JS", "Java", "Vaadin", "Spring Boot"]
      },
      {
        "title": "디지털 가축방역 시스템관리 웹 클라이언트",
        "company": "주식회사 도트만",
        "period": "2019.05 ~ 2019.12",
        "detail": "전자정부 프레임워크 프로젝트에 참여하여, 가축 방역에 관련된 시스템 관리 데이터를 활용하여 가축방역에 사용되는 차량을 통제하고 방역지역의 정보를 맵을 통해 CRUD를 할수있는 기능 등을 구현하였습니다. 또한 재사용성이 높은 CSS 클래스 체계를 구현하여 빠르게 UI를 개발할 수 있는 시스템을 구축하는 업무에도 함께 참여하였습니다. ",
        "spec": ["Javascript", "HTML 5", "CSS 3", "Jquery", "Java"]
      },
      {
        "title": "에듀엔플레이 홈페이지 개발",
        "company": "주식회사 도트만",
        "period": "2020.02 ~ 2020.05",
        "detail": "RESTful API를 이용한 서버와의 연동을 통한 React JS 기반 SPA 프로젝트 개발에 참여하여 전반적인 프론트엔드 영역인 퍼블리싱 구현과 비즈니스 로직이 포함된 컴포넌트 생성 작업을 담당하였습니다. 이때 프로젝트 중반에 투입되어 Redux를 이용하여 상태관리를 원활하게 할 수 있는 시스템을 구축하는데 기여하였고, 컴포넌트별로 패키지를 세분화하는 등 최신 트렌드에 맞는 방향으로 프로젝트를 이끌기 위해 노력한 끝에 가독성 높고 유지보수가 보다 수월한 방향으로 프로젝트를 이끌었습니다.",
        "spec": [
          "React JS",
          "Webpack",
          "Babel",
          "Axios",
          "Redux",
          "CSS 3",
          "Spring Boot"
        ]
      },
      {
        "title": "시와정보 홈페이지 개발",
        "company": "주식회사 도트만",
        "period": "2020.05 ~ 2020.06",
        "detail": "시와정보 홈페이지 개발에 참여하였으며, 최신 트렌드에 맞게 MVVM 디자인 패턴의 Vue JS 프레임워크를 도입하여 SPA 형식의 반응형 웹앱을 구현하습니다. 프로젝트 설계, 구현, 배포 및 유지보수 과정을 전적으로 담당하였습니다. 본 프로젝트의 배포는 AWS의 Nginx 환경을 이용하여 배포하여 AWS의 배포 환경과 리눅스의 사용법과 배포과정을 숙달하였습니다.",
        "spec": ["Vue JS", "Webpack", "Babel", "Axios", "Eslint", "CSS 3"]
      },
      {
        "title": "드론서비스 플렛폼 프론트엔드 UI 개발",
        "company": "주식회사 도트만",
        "period": "2020.05 ~ 현재",
        "detail": "드론 서비스 플렛폼 웹 클라이언트 개발의 프론트엔드 개발자로 참여 중입니다. 드론 컨트롤에 사용되는 UI인 만큼 복잡한 UI를 UX관점에서 접근하여 사용자의 업무 프로세스를 최단의 프로세스 패턴으로 구성하는데 심여를 기울이고 있습니다. Vue JS기반의 프로젝트이며, RESTful API를 이용하여 서버와 연동하여 드론을 컨트롤하고 수집된 정보를 UI를 통해 화면에 나타내는 기능을 구현하고있습니다. 가능한 심플하고 가독성 높은 코드를 작성하기 위해 ABC(always be componentized) 규칙에 따라 최대한 재사용 가능한 컴포넌트 생산하고 있습니다.",
        "spec": [
          "Vue JS",
          "Webpack",
          "Babel",
          "Axios",
          "Eslint",
          "CSS 3",
          "Open Layer",
          "Cesium JS"
        ]
      }
    ],
    "skills": [
      {
        "title": "Javascript",
        "icon": "mdi-language-javascript",
        "color": "yellow darken-1",
        "description": "ECMAScript 2015이후 문법을 주로 사용합니다. Execution Context를 기반으로 Scope, Hoisting, Promise등 기본적인 자바스크립트 구조를 이해하고 있으며, 업무에 능숙히 사용합니다."
      },
      {
        "title": "Html 5",
        "icon": "mdi-language-html5",
        "color": "orange",
        "description": "HTML 시맨틱과 DOM Tree대한 기본지식을 기반으로 웹페이지 마크업을 기술하며, meta요소와 같은 세부적인 요소들은 어떻게 동작하며 왜 만들어졌는지 생각하며 사용합니다."
      },
      {
        "title": "Css 3",
        "icon": "mdi-language-css3",
        "color": "blue",
        "description": " CSSOM Tree 대한 기본지식을 기반으로 웹페이지 랜더링에 대해 이해를 바탕으로 사용하고 있으며, SASS를 활용하여 Css 컴파일러를 사용할 수 있습니다."
      },
      {
        "title": "Vue JS",
        "icon": "mdi-vuejs",
        "color": "green",
        "description": "MVVM 디자인 패턴에서 ViewModel역할을 하는 Vue js의 본질적인 특성에 대한 이해를 바탕으로 Vue 프레임워크를 사용하며 협업을 위해 만들어진 프레임워크의 탄생 배경에 알맞는 보편화된 프로젝트 구조를 구성하여 사용합니다. "
      },
      {
        "title": "Java",
        "icon": "mdi-language-java",
        "color": "red",
        "description": "기초적인 자바 문법과 Spring Boot 프레임워크를 Domain Driven Design 패턴에 대해 이해와 함께 사용하며, 이를 활용하여 Entity와 Repository를 구현하여 데이터베이스와 연동하여 API를 호출하는 서버를 구현할 수 있습니다."
      },
      {
        "title": "RESTful",
        "icon": "mdi-video-input-antenna",
        "color": "grey",
        "description": "Axios를 활용한 RESTful API를 활용할 수 있으며, HTTP Protocol과 Methods의 활용방법을 숙지하고 있습니다."
      },
      {
        "title": "Git",
        "icon": "mdi-git",
        "color": "red",
        "description": "Git을 이용한 Version 컨트롤을 통해 프로젝트를 관리하며, Git을 통해 협업하는 것에 익숙합니다."
      },
      {
        "title": "Communication",
        "icon": "mdi-hand-okay",
        "color": "grey",
        "description": "효율적인 업무를 위해 사람과 사람간의 커뮤니케이션은 필수적이라고 생각합니다. 다름을 인정하고 개성을 존중하며 상대가 사용하는 단어나 말투보다 본질적인 메세지가 무엇인지 파악하기 위해 집중합니다. 타인의 입장에서 한번 더 생각하려하는 사고습관을 가지고 있습니다."
      }
    ],
    "english": {
      "level": "Advanced",
      "experience": "워킹홀리데이 및 어학연수",
      "term": "2년",
      "description": "2년동안 워킹 홀리데이와 어학연수를 통해 Advance 레벨의 외국인과 원활하게 커뮤니케이션 가능한 영어 실력을 갖추었습니다. 2년이라는 시간이 긴시간은 아니지만 현지에서 새미프로 축구선수 생활과 카페 아르바이트를 병행하며 현지인과 같은 환경속에서 치열하게 영어를 구사하며 생활했던 경험은 언제 어디서든 편하게 영어를 구사할 수 있는 능력을 만들어 주었습니다. "
    }
  }
}
